Ran Plan for project: `atlantis-test` dir: `modules` workspace: `atlantis-test`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.test_file will be created
+ resource "local_file" "test_file" {
      + content              = "This is a test file created by Terraform."
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./test.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p atlantis-test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-88-146.ec2.internal:4141/lock?id=yogeehhegde%252Ftest-atlantis%252Fmodules%252Fatlantis-test)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p atlantis-test
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```